In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
# pivot table is a flat table
# we need to consider what we are trying to look for in the table

In [5]:
import pandas.util.testing as tm;tm.N=3

def unpivot(frame):
    N, K = frame.shape
    data = {'value' : frame.values.ravel('F'),
           'variable' :np.asarray(frame.columns).repeat(N),
           'date':np.tile(np.asarray(frame.index),K)}
    return DataFrame(data, columns = ['date','variable','value'])
dframe = unpivot(tm.makeTimeDataFrame())

In [6]:
dframe

         date variable     value
0  2000-01-03        A -0.388938
1  2000-01-04        A  0.849752
2  2000-01-05        A  1.896864
3  2000-01-03        B  0.389305
4  2000-01-04        B -0.248204
5  2000-01-05        B  1.423679
6  2000-01-03        C -2.513388
7  2000-01-04        C  0.459382
8  2000-01-05        C  1.180599
9  2000-01-03        D  0.529854
10 2000-01-04        D -0.192763
11 2000-01-05        D -0.847766

In [7]:
dframe_piv = dframe.pivot('date','variable','value')

In [8]:
dframe_piv

variable           A         B         C         D
date
2000-01-03 -0.388938  0.389305 -2.513388  0.529854
2000-01-04  0.849752 -0.248204  0.459382 -0.192763
2000-01-05  1.896864  1.423679  1.180599 -0.847766

In [ ]:
/